
<!DOCTYPE HTML>
<html lang="pt" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Gerenciamento de arquivos · Manual GNU/Linux</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="glossario.html" />
    
    
    <link rel="prev" href="o_shell_e_o_terminal.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Escreva para pesquisar" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Manual GNU/Linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introducao.html">
            
                <a href="introducao.html">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="o_shell_e_o_terminal.html">
            
                <a href="o_shell_e_o_terminal.html">
            
                    
                    O shell e o terminal
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="gerenciamento_de_arquivos.html">
            
                <a href="gerenciamento_de_arquivos.html">
            
                    
                    Gerenciamento de arquivos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="glossario.html">
            
                <a href="glossario.html">
            
                    
                    Glossário
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="bibliografia.html">
            
                <a href="bibliografia.html">
            
                    
                    Bibliografia
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Publicado com GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Gerenciamento de arquivos</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="arquivos-no-gnulinux">Arquivos no GNU/Linux</h1>
<p>Os arquivos s&#xE3;o utilizados para gravar dados. Eles, podem conter um texto, uma m&#xFA;sica, programa, planilha, etc. </p>
<h2 id="nomes-e-extens&#xF5;es">Nomes e extens&#xF5;es</h2>
<p>Para facilitar a identifica&#xE7;&#xE3;o, cada arquivo deve ter um nome &#x2014; lembrando que o GNU/Linux &#xE9; <em>case sensitive</em>. No entanto, muitas vezes, n&#xE3;o &#xE9; poss&#xED;vel localizar ou saber como utiliz&#xE1;-lo somente pelo nome, por conta disso, existem as extens&#xF5;es. </p>
<p>A extens&#xE3;o s&#xE3;o os caracteres separados do nome do arquivo por um  <code>.</code>, assim: <code>nome_arquivo.extensao</code>. O uso de extens&#xF5;es n&#xE3;o &#xE9; obrigat&#xF3;rio na maioria das distribui&#xE7;&#xF5;es GNU/Linux, mas &#xE9; conveniente o seu uso para determinar facilmente o tipo de arquivo e qual programa utilizar para abri-lo.</p>
<p>No GNU/Linux, quando o primeiro caractere do nome &#xE9; um <code>.</code> significa que o arquivo em quest&#xE3;o &#xE9; oculto. Arquivos ocultos s&#xE3;o ignorados, ou seja, eles existem, mas n&#xE3;o s&#xE3;o listados &#x2014; a n&#xE3;o ser que seja explicitado.</p>
<h2 id="tipos-de-arquivos">Tipos de arquivos</h2>
<p>No GNU/Linux, existem sete tipos de arquivos, s&#xE3;o eles: </p>
<ul>
<li>Arquivo regular: &#xC9; o tipo mais comum de arquivo que se pode encontrar em um sistema GNU/Linux. Existem dois tipos de arquivos regulares:<ul>
<li>Arquivo de texto: Seu conte&#xFA;do &#xE9; compreendido pelas pessoas. Ele pode ser uma carta, um <em>script</em>, um programa de computador escrito pelo programador, arquivo de configura&#xE7;&#xE3;o, etc.</li>
<li>Arquivo bin&#xE1;rio: Seu conte&#xFA;do somente pode ser entendido por computadores. Ele &#xE9; gerado por um arquivo de programa atrav&#xE9;s de um processo chamado de compila&#xE7;&#xE3;o.</li>
</ul>
</li>
<li>Arquivo de diret&#xF3;rio: Armazena arquivos de qualquer tipo, inclusive outros diret&#xF3;rios. </li>
<li>Arquivo de dispositivo: S&#xE3;o utilizados para gerenciar os dispositivos de entrada e sa&#xED;da. Eles se subdividem em dois grupos:<ul>
<li>Arquivo de caractere: Nele, normalmente, os dados s&#xE3;o lidos e escritos diretamente no dispositivo, dispensando o uso de <em>buffers</em>.</li>
<li>Arquivos de bloco: Nele, as opera&#xE7;&#xF5;es de entrada e sa&#xED;da s&#xE3;o realizadas de modo aleat&#xF3;rio, em blocos, fazendo o uso de <em>buffers</em> intermedi&#xE1;rios.</li>
</ul>
</li>
<li>Arquivo de <em>socket</em>: Permite a comunica&#xE7;&#xE3;o entre dois processos que compartilham dados. Ele permite a comunica&#xE7;&#xE3;o at&#xE9; mesmo entre sistemas operacionais diferentes.</li>
<li>Arquivo <em>pipe</em>: Permite a comunica&#xE7;&#xE3;o entre dois processos executados no mesmo sistema operacional.</li>
<li>Arquivo de <em>link</em> simb&#xF3;lico: Armazena uma representa&#xE7;&#xE3;o textual do caminho para um arquivo referenciado.</li>
</ul>
<h1 id="diret&#xF3;rios-no-gnulinux">Diret&#xF3;rios no GNU/Linux</h1>
<p>O diret&#xF3;rio &#xE9; um arquivo utilizado para armazenar conjuntos de arquivos. Com os diret&#xF3;rios &#xE9; poss&#xED;vel manter os arquivos organizados. </p>
<p>No GNU/Linux n&#xE3;o &#xE9; permitido a exist&#xEA;ncia de dois arquivos com o mesmo nome no mesmo diret&#xF3;rio. As exce&#xE7;&#xE3;o s&#xE3;o:</p>
<ul>
<li>Arquivos de mesmo nome com extens&#xF5;es diferentes. </li>
<li>Dois arquivos com o mesmo nome, e at&#xE9; com a mesma extens&#xE3;o, com um deles oculto.</li>
</ul>
<h2 id="estrutura--de-diret&#xF3;rios-do-gnulinux">Estrutura  de diret&#xF3;rios do GNU/Linux</h2>
<p>O sistema GNU/Linux possui uma estrutura b&#xE1;sica de diret&#xF3;rios. Essa estrutura tamb&#xE9;m &#xE9; conhecida como &#xC1;rvore de Diret&#xF3;rios, porque &#xE9; parecida com uma &#xE1;rvore de cabe&#xE7;a para baixo. Cada diret&#xF3;rio do sistema tem seus respectivos arquivos que s&#xE3;o armazenados conforme regras definidas pela <em>Filesystem Hierarchy Standard (FHS)</em> da seguinte forma:</p>
<ul>
<li><code>/</code>: Diret&#xF3;rio principal do sistema. Dentro dele est&#xE3;o todos os diret&#xF3;rios do sistema.</li>
<li><code>/bin</code>: &#xC9; reservado para gravar comandos que ser&#xE3;o utilizados por todos os usu&#xE1;rios.</li>
<li><code>/boot</code>: Cont&#xE9;m os arquivos necess&#xE1;rios para a inicializa&#xE7;&#xE3;o do sistema.</li>
<li><code>/cdrom</code>: Este diret&#xF3;rio n&#xE3;o faz parte do padr&#xE3;o de hierarquia <em>FHS</em>, por&#xE9;m ele ainda &#xE9; encontrado em algumas distribui&#xE7;&#xF5;es GNU/Linux. &#xC9; utilizado como local tempor&#xE1;rio para <em>CDs</em> e <em>DVDs</em> inseridos no computador &#x2014; por&#xE9;m, o local padr&#xE3;o para essas m&#xED;dias &#xE9; o diret&#xF3;rio <code>/media</code>.</li>
<li><code>/dev</code>:  Cont&#xE9;m arquivos gerados pelos dispositivos de <em>hardware</em>, como processador, placa de v&#xED;deo, leitor de m&#xED;dia etc.</li>
<li><code>/etc</code>: Guarda a maioria dos arquivos essenciais do sistema operacional do computador local, como configura&#xE7;&#xE3;o usados para controlar uma opera&#xE7;&#xE3;o ou programa.</li>
<li><code>/home</code>: Local destinado para os arquivos dos usu&#xE1;rios, com exce&#xE7;&#xE3;o do <em>root</em>.</li>
<li><code>/lib</code>: Cont&#xE9;m diret&#xF3;rios e <em>links</em> simb&#xF3;licos compartilhados pelos programas do sistema e m&#xF3;dulos do <em>kernel</em>.</li>
<li><code>/lost+found</code>: Local para a grava&#xE7;&#xE3;o de arquivos corrompidos, recuperados ap&#xF3;s uma verifica&#xE7;&#xE3;o do sistema de arquivos &#x2014; esse tipo de verifica&#xE7;&#xE3;o ocorre na primeira reinicializa&#xE7;&#xE3;o ap&#xF3;s um travamento no sistema.</li>
<li><code>/media</code>: Ponto de montagem de dispositivos remov&#xED;veis como <em>pendrives</em>, <em>CDs</em>, <em>Blu-Ray</em> etc.</li>
<li><code>/mnt</code>: Ponto de montagem de subdiret&#xF3;rios tempor&#xE1;rios de dispositivos n&#xE3;o remov&#xED;veis e arquivos, como imagens ISO.</li>
<li><code>/opt</code>: &#xC9; uma &#xE1;rea reservada para instala&#xE7;&#xF5;es de pacotes de aplica&#xE7;&#xF5;es que otimizam o funcionamento de determinado programa ou acrescentam novos recursos.</li>
<li><code>/proc</code>: &#xC9; usado pelo <em>kernel</em> para guardados registros de desempenho e status de processos.</li>
<li><code>/root</code>: Diret&#xF3;rio padr&#xE3;o do usu&#xE1;rio <em>root</em>.</li>
<li><code>/run</code>: Fornece &#xE0;s aplica&#xE7;&#xF5;es um local para armazenamento de arquivos tempor&#xE1;rios que, diferentemente dos arquivos armazenados no <code>/tmp</code>, em caso de exclus&#xE3;o causam problemas &#xE0;s aplica&#xE7;&#xF5;es que os utilizam.</li>
<li><code>/sbin</code>: Re&#xFA;ne arquivos bin&#xE1;rios acionados pelo sistema em si ou pelo <em>root</em> em processos de manuten&#xE7;&#xE3;o.</li>
<li><code>/srv</code>: Possui dados que s&#xE3;o utilizados por servi&#xE7;os armazenados, como <em>web servers</em>.</li>
<li><code>/sys</code>: Sistema de arquivos do <em>kernel</em>, que facilitar a troca de informa&#xE7;&#xF5;es entre os programas que rodam no espa&#xE7;o do <em>kernel</em>, como os <em>drivers</em>, com os programas que rodam no espa&#xE7;o do usu&#xE1;rio &#x2014; por isso, esse diret&#xF3;rio &#xE9; usado por diversos programas.</li>
<li><code>/tmp</code>: Diret&#xF3;rio para armazenamento de arquivos tempor&#xE1;rios criados por programas.</li>
<li><code>/usr</code>: Cont&#xE9;m a maior parte dos programas. Normalmente acess&#xED;vel somente como leitura.</li>
<li><code>/var</code>: Aqui s&#xE3;o armazenados logs e arquivos variados que normalmente seriam escritos em <code>/usr</code>.</li>
</ul>
<h1 id="manipula&#xE7;&#xE3;o-de-arquivos">Manipula&#xE7;&#xE3;o de arquivos</h1>
<p>Abaixo est&#xE3;o listados comandos &#xFA;teis para a manipula&#xE7;&#xE3;o de arquivos.</p>
<h2 id="ls"><code>ls</code></h2>
<ul>
<li>Utilidade: Listar os arquivos de um diret&#xF3;rio.</li>
<li>Estrutura: <strong><code>ls</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em> <em><code>[caminhos|arquivos]</code></em>.</li>
<li>Op&#xE7;&#xF5;es:<ul>
<li><code>-a</code>: Lista todos os arquivos, inclusive os ocultos, de um diret&#xF3;rio.</li>
<li><code>-l</code>:  Lista permiss&#xF5;es, donos, grupos, tamanho em <em>bytes</em> e data de modifica&#xE7;&#xE3;o dos arquivos.</li>
<li><code>-lh</code>: Edita o tamanho dos arquivos mostrando pela op&#xE7;&#xE3;o <code>-l</code>, ou seja, o tamanho dos arquivos ser&#xE3;o exibidos em <em>Kbytes</em>, <em>Mbytes</em> ou <em>Gbytes</em> &#x2014; o que o GNU/Linux julgar mais conveniente. </li>
</ul>
</li>
<li>Macetes: <ol>
<li><code>ls -lha</code> &#xE9; uma concatena&#xE7;&#xE3;o das op&#xE7;&#xF5;es <code>-l</code>, <code>-h</code>, <code>-a</code>. Quando se trata de listagem, talvez, seja o comando mais completo.</li>
<li>&#xC9; poss&#xED;vel listar v&#xE1;rios diret&#xF3;rio com um &#xFA;nico comando. Por exemplo, o comando <code>ls . /</code> retornar&#xE1; a listagem do diret&#xF3;rio atual e do diret&#xF3;rio raiz do GNU/Linux.</li>
</ol>
</li>
</ul>
<h2 id="cd"><code>cd</code></h2>
<ul>
<li>Utilidade: Entrar em um diret&#xF3;rio. O usu&#xE1;rio precisa ter a permiss&#xE3;o de execu&#xE7;&#xE3;o para entrar no diret&#xF3;rio.</li>
<li>Estrutura: <strong><code>cd</code></strong> <em><code>[caminho|diret&#xF3;rio]</code></em>.</li>
<li>Macetes: <ol>
<li><code>cd /</code>: Levar&#xE1; ao diret&#xF3;rio raiz do GNU/Linux.</li>
<li><code>cd ~</code>: Levar&#xE1; para o diret&#xF3;rio padr&#xE3;o do usu&#xE1;rio que est&#xE1; operando o GNU/Linux.</li>
<li><code>cd -</code>: Levar&#xE1; ao &#xFA;ltimo diret&#xF3;rio acessado.</li>
<li><code>cd ..</code>: Levar&#xE1; &#xE0; um diret&#xF3;rio a cima.</li>
<li><code>cd ../ [caminho|diret&#xF3;rio]</code>: Levar&#xE1; &#xE0; um diret&#xF3;rio a cima e  entrar&#xE1;, caso exista, no diret&#xF3;rio do caminho informado.</li>
</ol>
</li>
</ul>
<h2 id="pwd"><code>pwd</code></h2>
<ul>
<li>Utilidade: Mostrar o nome e caminho do diret&#xF3;rio atual.</li>
</ul>
<h2 id="mkdir"><code>mkdir</code></h2>
<ul>
<li>Utilidade: Criar um diret&#xF3;rio no GNU/Linux.</li>
<li>Estrutura: <strong><code>mkdir</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em> <em><code>[caminhos|diret&#xF3;rios]</code></em>.</li>
<li>Op&#xE7;&#xF5;es: <ul>
<li><code>-p</code>: Caso os diret&#xF3;rios dos n&#xED;veis acima n&#xE3;o existam, eles tamb&#xE9;m ser&#xE3;o criados.</li>
<li><code>-v</code>: Mostra uma mensagem para cada diret&#xF3;rio criado.</li>
</ul>
</li>
<li>Macetes: <ol>
<li>Para criar um novo diret&#xF3;rio, o usu&#xE1;rio deve ter permiss&#xE3;o de grava&#xE7;&#xE3;o.</li>
<li>&#xC9; poss&#xED;vel criar v&#xE1;rios diret&#xF3;rio com um &#xFA;nico comando. Por exemplo, o comando <code>mkdir diretorio1 diret&#xF3;rio2</code> criar&#xE1; dois diret&#xF3;rios &#x2014; o <code>diretorio1</code> e o <code>diret&#xF3;rio2</code>.</li>
</ol>
</li>
</ul>
<h2 id="rmdir"><code>rmdir</code></h2>
<ul>
<li>Utilidade: Remover um diret&#xF3;rio vazio do GNU/Linux.</li>
<li>Estrutura: <strong><code>rmdir</code></strong> <em><code>[caminhos|diret&#xF3;rios]</code></em>.</li>
<li>Macetes: <ol>
<li>Para remove um diret&#xF3;rio, o usu&#xE1;rio deve ter permiss&#xE3;o de grava&#xE7;&#xE3;o sobre ele.</li>
<li>&#xC9; poss&#xED;vel remover v&#xE1;rios diret&#xF3;rio com um &#xFA;nico comando. Por exemplo, o comando <code>mkdir diretorio1 diret&#xF3;rio2</code> remover&#xE1; tanto o <code>diretorio1</code> quanto o <code>diret&#xF3;rio2</code> &#x2014; desde que ambos estejam vazios.</li>
<li>Para remover um diret&#xF3;rio que cont&#xE9;m arquivos, basta usar o comando <strong><code>rm</code></strong> com a op&#xE7;&#xE3;o <code>-r</code> seguida pelo diret&#xF3;rio que deseja remover.</li>
</ol>
</li>
</ul>
<h2 id="cat"><code>cat</code></h2>
<ul>
<li>Utilidade: Mostrar o conte&#xFA;do de um arquivo bin&#xE1;rio ou de texto.</li>
<li>Estrutura:  <strong><code>cat</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em> <em><code>[caminhos|arquivos]</code></em>.</li>
<li>Op&#xE7;&#xF5;es:<ul>
<li><code>-n</code>: Mostra o n&#xFA;mero das linhas enquanto o conte&#xFA;do do arquivo &#xE9; mostrado.</li>
</ul>
</li>
</ul>
<h2 id="touch"><code>touch</code></h2>
<ul>
<li>Utilidade: Criar um arquivo regular em branco</li>
<li>Estrutura:  <strong><code>touch</code></strong> <em><code>[caminhos|arquivos]</code></em>.</li>
<li>Macetes: <ol>
<li>&#xC9; poss&#xED;vel criar v&#xE1;rios arquivos com um &#xFA;nico comando. Por exemplo, o comando <code>touch arquivo1 arquivo2</code> criar&#xE1; dois arquivos &#x2014; o <code>arquivo1</code> e o <code>arquivo2</code>.</li>
<li>Para escrever algo no arquivo basta utilizar um editor de texto como por exemplo o Nano ou o Vim.</li>
</ol>
</li>
</ul>
<h2 id="rm"><code>rm</code></h2>
<ul>
<li>Utilidade: Remover arquivos.</li>
<li>Estrutura: <strong><code>rm</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em> <em><code>[caminhos|diret&#xF3;rios]</code></em>.</li>
<li>Op&#xE7;&#xF5;es: <ul>
<li><code>-i</code>: Pergunta antes de remover um arquivos.</li>
<li><code>-v</code>: Mostra os arquivos a medida que s&#xE3;o removidos.</li>
<li><code>-r</code>: Remove arquivos em subdiret&#xF3;rios e em seguida o subdiret&#xF3;rio.</li>
</ul>
</li>
<li>Macetes:<ol>
<li><code>rm -r</code> <em><code>[caminho|diret&#xF3;rio]</code></em> &#xE9; utilizado para remover um diret&#xF3;rio. </li>
</ol>
</li>
</ul>
<h2 id="cp"><code>cp</code></h2>
<ul>
<li>Utilidade: Copiar arquivos.</li>
<li>Estrutura: <strong><code>cp</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em>  <em><code>[origem]</code></em> <em><code>[destino]</code></em></li>
<li>Op&#xE7;&#xF5;es:<ul>
<li><code>-r</code> Copia arquivos dos diret&#xF3;rios e subdiret&#xF3;rios da origem para o destino.</li>
<li><code>-v</code>: Mostra os arquivos a medida que s&#xE3;o copiados.</li>
<li><code>-l</code>: Faz o <em>link</em> simb&#xF3;lico no destino ao inv&#xE9;s de copiar os arquivos.</li>
</ul>
</li>
</ul>
<h2 id="mv"><code>mv</code></h2>
<ul>
<li>Utilidade: Mover arquivos.</li>
<li>Estrutura: <strong><code>mv</code></strong> <em><code>[op&#xE7;&#xF5;es]</code></em>  <em><code>[origem]</code></em> <em><code>[destino]</code></em></li>
<li>Op&#xE7;&#xF5;es:<ul>
<li><code>-v</code>: Mostra os arquivos a medida que s&#xE3;o movidos.</li>
</ul>
</li>
</ul>
<h2 id="find"><code>find</code></h2>
<ul>
<li>Utilidade: Buscar arquivos.</li>
<li>Estrutura: <strong><code>find</code></strong> <em><code>[diretorio]</code></em>  <em><code>[op&#xE7;&#xF5;es]</code></em> <em><code>[express&#xE3;o]</code></em></li>
<li>Op&#xE7;&#xF5;es:<ul>
<li><code>-atime</code>: Procurar arquivos acessados dentro de um intervalo de dias.</li>
<li><code>-mtime</code>: Procurar arquivos modificados dentro de um intervalo de dias.</li>
<li><code>-ctime</code>: Procurar arquivos criados dentro de um intervalo de dias.</li>
<li><code>-name</code>: Procura um arquivo pelo nome &#x2014; &#xE9; <em>case sensitive</em>.</li>
<li><code>-iname</code>: Procura um arquivo pelo nome &#x2014; n&#xE3;o &#xE9; <em>case sensitive</em>.</li>
<li><code>-user</code>: Procura arquivos pelo usu&#xE1;rio.</li>
<li><code>-goup</code>: Procura arquivos pelo grupo.</li>
<li><code>-perm</code>: Procura arquivos pela permiss&#xE3;o.</li>
<li><code>-type</code>: Procura um arquivo pelo tipo. Os seguintes tipos s&#xE3;o aceitos:<ul>
<li><code>f</code>: arquivo regular;</li>
<li><code>d</code>: diret&#xF3;rio;</li>
<li><code>b</code>: bloco;</li>
<li><code>c</code>: caractere;</li>
<li><code>l</code>: <em>link</em> simb&#xF3;lico;</li>
<li><code>p</code>: <em>pipe</em>;    </li>
<li><code>s</code>: <em>socket</em>.</li>
</ul>
</li>
</ul>
</li>
<li>Macetes: <ol>
<li>Para fazer buscas  com o <code>-atime</code>, <code>-mtime</code> ou <code>-ctime</code> &#xE9; interessante n&#xE3;o somente indicar os dias, mas tamb&#xE9;m especificar o intervalo. O <code>-</code> significa &quot;a menos de&quot;, enquanto o <code>+</code> significa &quot;a mais de&quot;. Por exemplo, o comando <code>find / -atime -2</code> busca arquivos acessados a menos de dois dias.</li>
<li>&#xC9; poss&#xED;vel concatenar as op&#xE7;&#xF5;es e fazer buscas mais refinadas. Por exemplo: <code>find / -iname teste -user root</code>.</li>
</ol>
</li>
</ul>
<h1 id="refer&#xEA;ncias-globais">Refer&#xEA;ncias globais</h1>
<p>Coringas, ou refer&#xEA;ncias globais, &#xE9; um recurso usado para especificar um ou mais arquivos do sistema de uma s&#xF3; vez. Este recurso permite fazer a filtragem do que ser&#xE1; listado, copiado, apagado, buscados e etc. No GNU/Linux s&#xE3;o usados 4 tipos de coringas, s&#xE3;o eles:</p>
<ul>
<li><code>*</code>: Faz refer&#xEA;ncia a um nome completo ou restante de um arquivo.</li>
<li><code>?</code>:  Faz refer&#xEA;ncia a uma letra naquela posi&#xE7;&#xE3;o.</li>
<li><code>[ ]</code>: Faz refer&#xEA;ncia a uma faixa de caracteres de um arquivo. Os padr&#xF5;es aceitos est&#xE3;o listados abaixo &#x2014; caso qualquer um deles for precedido por um <code>^</code> significa que a express&#xE3;o deve desconsiderar os caracteres indicados:    <ul>
<li><code>[a-z][0-9]</code>: Faz refer&#xEA;ncia aos caracteres de <code>a</code> at&#xE9; <code>z</code> seguido de um caractere de <code>0</code> at&#xE9; <code>9</code>.</li>
<li><code>[a,z][1,0]</code>: Faz refer&#xEA;ncia aos caracteres <code>a</code> e <code>z</code> seguido de um caractere <code>1</code> ou <code>0</code> naquela posi&#xE7;&#xE3;o.</li>
<li><code>[a-z,1,0]</code>: Faz refer&#xEA;ncia ao intervalo de caracteres de <code>a</code> at&#xE9; <code>z</code> ou <code>1</code> ou <code>0</code> naquela posi&#xE7;&#xE3;o.   </li>
</ul>
</li>
<li><code>{ }</code>: Expande e gera strings para pesquisa de padr&#xF5;es de um arquivo/diret&#xF3;rio.<ul>
<li><code>X{ab,01}</code>: Faz refer&#xEA;ncia a sequencia de caracteres <code>Xab</code> ou <code>X01</code>.</li>
<li><code>X{a-z,10}</code>: Faz referencia a sequencia de caracteres <code>Xa-z</code> e <code>X10</code>.</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="o_shell_e_o_terminal.html" class="navigation navigation-prev " aria-label="Previous page: O shell e o terminal">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="glossario.html" class="navigation navigation-next " aria-label="Next page: Glossário">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Gerenciamento de arquivos","level":"1.4","depth":1,"next":{"title":"Glossário","level":"1.5","depth":1,"path":"glossario.md","ref":"glossario.md","articles":[]},"previous":{"title":"O shell e o terminal","level":"1.3","depth":1,"path":"o_shell_e_o_terminal.md","ref":"o_shell_e_o_terminal.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","github","sharing-plus","back-to-top-button","download-pdf-link"],"root":"./pages","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github":{"url":"https://github.com/GeovanneAtanazio/manual_linux/"},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"sepia","family":"sans","size":2},"highlight":{},"back-to-top-button":{},"download-pdf-link":{"label":"Download PDF","base":"https://github.com/GeovanneAtanazio/manual_linux/blob/main/Manual_GNU_Linux.pdf"},"sharing":{"qq":false,"all":["twitter","linkedin","whatsapp","facebook","messenger"],"douban":false,"facebook":false,"weibo":false,"whatsapp":false,"line":false,"google":false,"qzone":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"apresentacao.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Manual GNU/Linux","language":"pt","gitbook":"*","description":"Manual com o conhecimento institucional de GNU/Linux"},"file":{"path":"gerenciamento_de_arquivos.md","mtime":"2021-07-14T13:10:58.489Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-07-14T13:13:08.696Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-download-pdf-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

